[
  {
    "nivel": "TRL 1 - Princípios Básicos Observados e Relatados",
    "perguntas": [
      {
        "pergunta": "Os princípios físicos e eletrônicos fundamentais (ex: semicondutores, circuitos RC, leis de Kirchhoff) foram identificados e compreendidos?",
        "explicacao": ""
      },
      {
        "pergunta": "Existem estudos teóricos ou práticos que sustentam a base eletrônica do projeto? Foram realizados testes para validação dos conceitos fundamentais?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as normas técnicas e regulamentações aplicáveis (ex: ANATEL, IEC, FCC)? Foram consideradas as regulamentações legais, como a LGPD, para garantir conformidade?",
        "explicacao": ""
      },
      {
        "pergunta": "Riscos técnicos iniciais, como interferência eletromagnética e consumo de energia, foram avaliados?",
        "explicacao": ""
      },
      {
        "pergunta": "As ferramentas e metodologias para P&D em eletrônica foram selecionadas e validadas para esta fase?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 2 - Formulação do Conceito Tecnológico",
    "perguntas": [
      {
        "pergunta": "As possíveis aplicações da solução eletrônica foram descritas (ex: automação, IoT, controle industrial)?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram definidas as principais funções eletrônicas do sistema (ex: sensoriamento, controle, atuação)?",
        "explicacao": ""
      },
      {
        "pergunta": "O conceito do circuito ou sistema eletrônico foi modelado ou simulado teoricamente?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas limitações iniciais de projeto como ruído, latência, dissipação térmica?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi verificada a viabilidade das aplicações propostas por benchmarking ou projetos similares?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 3 - Prova de Conceito Experimental",
    "perguntas": [
      {
        "pergunta": "Foi documentado o projeto conceitual dos circuitos ou placas eletrônicas?",
        "explicacao": ""
      },
      {
        "pergunta": "Os requisitos elétricos (tensão, corrente, impedância, etc.) foram especificados?",
        "explicacao": ""
      },
      {
        "pergunta": "Simulações (ex: SPICE) ou montagens de bancada demonstraram a viabilidade do conceito?",
        "explicacao": ""
      },
      {
        "pergunta": "Houve identificação de falhas ou gargalos durante os primeiros testes?",
        "explicacao": ""
      },
      {
        "pergunta": "A escolha de componentes eletrônicos foi baseada em critérios técnicos e de disponibilidade?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram exploradas técnicas de desenvolvimento como modularidade, proteção contra surtos, filtros?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 4 - Validação de Componentes em Ambiente Laboratorial",
    "perguntas": [
      {
        "pergunta": "Os módulos eletrônicos foram testados de forma isolada com instrumentação adequada (osciloscópio, multímetro, etc.)?",
        "explicacao": ""
      },
      {
        "pergunta": "Falhas críticas e limitações de projeto foram devidamente documentadas?",
        "explicacao": ""
      },
      {
        "pergunta": "Os requisitos do sistema final foram alinhados com as funcionalidades dos módulos testados?",
        "explicacao": ""
      },
      {
        "pergunta": "Indicadores como consumo de potência, tempo de resposta, imunidade a ruído foram medidos?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 5 - Validação do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "O sistema eletrônico foi testado em um ambiente próximo ao de operação real (ex: gabinete, campo, instalação)?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram avaliadas falhas potenciais como interferência, aquecimento, falha de comunicação?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram definidos os requisitos de interface elétrica e lógica entre os módulos?",
        "explicacao": ""
      },
      {
        "pergunta": "A integração entre subsistemas (ex: sensores, atuadores, microcontrolador) foi realizada e testada?",
        "explicacao": ""
      },
      {
        "pergunta": "Houve documentação das condições de operação e resultados dos testes em campo simulado?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 6 - Demonstração do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "As funções críticas como redundância, proteção, fail-safe foram analisadas e documentadas?",
        "explicacao": ""
      },
      {
        "pergunta": "O sistema foi testado em condições de operação representativas de uso real?",
        "explicacao": ""
      },
      {
        "pergunta": "Requisitos de desempenho, limites de operação e ambiente foram formalmente registrados?",
        "explicacao": ""
      },
      {
        "pergunta": "A documentação técnica dos subsistemas está completa e padronizada?",
        "explicacao": ""
      },
      {
        "pergunta": "Um protótipo funcional foi submetido a testes de estresse e validado em laboratório ou bancada de simulação?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 7 - Demonstração do Protótipo em Ambiente Realista",
    "perguntas": [
      {
        "pergunta": "O protótipo eletrônico foi integrado a um sistema funcional completo?",
        "explicacao": ""
      },
      {
        "pergunta": "Testes de desempenho foram conduzidos sob diferentes condições de carga e ambiente?",
        "explicacao": ""
      },
      {
        "pergunta": "Procedimentos para validação do protótipo foram definidos e seguidos?",
        "explicacao": ""
      },
      {
        "pergunta": "As interfaces foram testadas contra variações elétricas e ruídos externos?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi avaliada a robustez do sistema em ciclos prolongados de operação?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 8 - Certificação do Sistema Completo",
    "perguntas": [
      {
        "pergunta": "O sistema eletrônico foi certificado por órgãos competentes (ex: INMETRO, FCC)?",
        "explicacao": ""
      },
      {
        "pergunta": "Compatibilizações finais entre componentes, firmware e interfaces foram concluídas?",
        "explicacao": ""
      },
      {
        "pergunta": "A documentação de produção, manutenção e manuais técnicos foi finalizada?",
        "explicacao": ""
      },
      {
        "pergunta": "Todos os critérios de projeto (funcionalidade, segurança, EMC) foram atendidos?",
        "explicacao": ""
      },
      {
        "pergunta": "Planos de controle e rastreabilidade de versões foram estabelecidos?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 9 - Sistema Operacional e Produção em Escala",
    "perguntas": [
      {
        "pergunta": "O sistema eletrônico está em operação estável no ambiente final de uso?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi comprovada a reprodutibilidade do sistema com os mesmos parâmetros técnicos?",
        "explicacao": ""
      },
      {
        "pergunta": "Processos industriais para produção em série foram definidos e validados?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram registrados patentes, publicações ou manuais de aplicação?",
        "explicacao": ""
      },
      {
        "pergunta": "Existe plano de suporte, manutenção e atualização para a versão comercial?",
        "explicacao": ""
      }
    ]
  }
]