[
  {
    "nivel": "TRL 1: Principios básicos observados e reportados",
    "perguntas": [
      {
        "pergunta": "Foram identificadas leis e regulamentações aplicáveis ao software (LGPD, Propriedade Intelectual) e não há impedimentos para sua aplicação? Foram consideradas as regulamentações legais, como a LGPD, para garantir conformidade?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas leis e regulamentações aplicáveis ao software relacionadas à cibersegurança, e não há impedimentos para sua aplicação?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi levantada e documentada a ideia dos riscos, custos e cronograma para o desenvolvimento do software?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os responsáveis e o local onde será realizada a pesquisa para desenvolvimento do software?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 2: Conceito tecnológico e/ou aplicação formulados",
    "perguntas": [
      {
        "pergunta": "Foram formuladas as potenciais aplicações do software?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi elaborado documento de requisitos do sistema?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi elaborada a arquitetura de software do sistema?",
        "explicacao": ""
      },
      {
        "pergunta": "Caso a solução tenha interface gráfica, foi feito um estudo de usabilidade e experiência do usuário?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi elaborada a prototipação de telas do sistema?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi elaborado planos de teste para validação do sistema",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizada pesquisa em ambiente de desenvolvimento ou testes de viabilidade?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as principais funcionabilidades que o software deverá desepenhar?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi documentada a viabilidade das aplicações confirmadas por estudos ou benchmarks? Foram realizados testes para validação dos conceitos fundamentais?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi identificada a funcionalidade da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados possíveis GAPs da tecnologia e documentados?",
        "explicacao": ""
      },
      {
        "pergunta": "Sabe que programa (projeto) a tecnologia vai apoiar?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 3: Tecnologia validada em ambiente simulado",
    "perguntas": [
      {
        "pergunta": "Foi idealizado o projeto conceitual do elemento e documentado? ",
        "explicacao": ""
      },
      {
        "pergunta": "Foram especificados os requisitos de desempenho da tecnologia em ambiente operacional?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi verificada a viabilidade da aplicação por testes unitários ou simulações?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os possíveis falhas da tecnologia em ambientes de teste? ",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados e documentados os componentes que devem interagir(visão sistêmica)? ",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as tecnicas de desenvolvimento da tecnologia?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 4: Tecnologia validada em ambiente relevante",
    "perguntas": [
      {
        "pergunta": "Foi consolidado o projeto conceitual da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "Os componentes individuais do software foram testados isoladamente e os relatórios foram gerados?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram totalmente identificados os possíveis GAP’s da tecnologia ?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os requisitos gerais do sistema para aplicação aos usuários finais? ",
        "explicacao": ""
      },
      {
        "pergunta": "Foram estabelecidas as métricas de desempenho da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram iniciados os estudos de integração do software com outros sistemas necessários?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 5: Tecnologia testada em ambiente relevante",
    "perguntas": [
      {
        "pergunta": "Foi realizado a definição preliminar de requisitos de desempenho no ambiente operacional do software?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi desenvolvido um protótipo preliminar do elemento, validado por meio de testes de funções críticas?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizado plano de teste de função crítica para análise dos efeitos de escala?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os requisitos de interface de sistema?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as interações entre os componentes / subsistemas?",
        "explicacao": ""
      },
      {
        "pergunta": "O ambiente de teste foi modificado para se aproximar de um ambiente operacional realista?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados testes do software em um ambiente relevante?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 6: Sistema demonstrado em ambiente relevante",
    "perguntas": [
      {
        "pergunta": "Foram realizados identificação e análise das funções críticas do elemento e verificadas as funções críticas e documentadas em relatório?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram documentados os requisitos completos de sistema e subsistema para funcionamento?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram concluídas as avaliações das características de desempenho da tecnologia mesmo com os possíveis GAP`s?",
        "explicacao": ""
      },
      {
        "pergunta": "Um modelo funcional (protótipo) foi testado em um ambiente operacional de alta fidelidade (simulação ou teste em ambiente realista)?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 7: Sistema operacional demonstrado em ambiente operacional",
    "perguntas": [
      {
        "pergunta": "Foi documentada a definição de requisitos de desempenho?",
        "explicacao": ""
      },
      {
        "pergunta": "O ambiente operacional real do software foi definido e documentado?",
        "explicacao": ""
      },
      {
        "pergunta": "A versão beta foi desenvolvida e testada com usuários reais ou simulações?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi simulado as funcionalidades disponíveis para demonstração em ambiente operacional?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi totalmente integrado o protótipo ao ambiente operacional demonstrado (ou simulado ambiente operacional)?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizado documentação do teste do modelo de protótipo?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 8: Sistema completo qualificado (BETA)",
    "perguntas": [
      {
        "pergunta": "O software foi finalizado e integrado ao sistema de produção?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados ajustes dos módulos e funcionalidades para compatibilidade com os requisitos de produção?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi testado o sistema e caracterizado com seu design e função para a funcionabilidade pretendida?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram demonstrados os resultados o funcionamentos e a função da tecnologia em eventual teste de sistema de plataforma?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi concluída a documentação da gestão e controle de configuração?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram demonstradas todas as funcionalidades em ambiente operacional simulado e sistema qualificados através de teste e avaliação na plataforma real?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi identificado que o sistema atende às especificações? ",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 9: Sistema comprovado em operações reais",
    "perguntas": [
      {
        "pergunta": "O software foi colocado em produção e passou por uma fase inicial de operação controlada?",
        "explicacao": ""
      },
      {
        "pergunta": "O sistema real foi plenamente demonstrado e aprovado para uso contínuo?",
        "explicacao": ""
      },
      {
        "pergunta": "O conceito operacional do software foi implementado com sucesso?",
        "explicacao": ""
      }
    ]
  }
]