[
  {
    "nivel": "TRL 1 - Princípios Básicos Observados e Relatados",
    "perguntas": [
      {
        "pergunta": "Os princípios teóricos e físicos que fundamentam o produto/processo estão identificados?"
      },
      {
        "pergunta": "Existem estudos ou experimentos que confirmam os princípios básicos tecnológicos para funcionamento do produto/processo?"
      },
      {
        "pergunta": "Foram avaliadas restrições legais e normativas que possam impactar o desenvolvimento almejado?"
      },
      {
        "pergunta": "Foram avaliados os riscos técnicos e desafios na viabilidade da implementação do produto/processo?"
      },
      {
        "pergunta": "Foram identificadas as ferramentas e metodologias para pesquisa e desenvolvimento do produto/processo?"
      }
    ]
  },
  {
    "nivel": "TRL 2 - Formulação do Conceito Tecnológico",
    "perguntas": [
      {
        "pergunta": "Foram formuladas as potenciais aplicações do produto/processo?"
      },
      {
        "pergunta": "Foram identificadas as principais funções a serem desempenhadas pelo produto/processo?"
      },
      {
        "pergunta": "Foram identificadas as possíveis funcionalidades do produto/processo?"
      },
      {
        "pergunta": "Foram identificados possíveis \"GAPs\" da tecnologia e documentados?"
      },
      {
        "pergunta": "Já foi concebido um projeto conceitual preliminar para o produto/processo e, considerando-o, foi (ou é) possível demonstrar a viabilidade teórica do produto?"
      },
      {
        "pergunta": "Foi documentada a viabilidade das aplicações do produto/processo, com base em estudos preliminares?"
      },
      {
        "pergunta": "Foram especificados os requisitos de desempenho do produto/processo?"
      }
    ]
  },
  {
    "nivel": "TRL 3 - Prova de Conceito Experimental",
    "perguntas": [
      {
        "pergunta": "Foi concretizada a documentação do projeto conceitual do produto/processo?"
      },
      {
        "pergunta": "Foi verificada a viabilidade da aplicação do produto/processo por experimentos de laboratório (ou simulação)?"
      },
      {
        "pergunta": "Se foram identificadas possíveis falhas na concepção do produto em função de experimentos de laboratório, o projeto conceitual foi reavaliado?"
      },
      {
        "pergunta": "Foram identificadas e estão disponíveis as técnicas para desenvolvimento do produto/processo?"
      }
    ]
  },
  {
    "nivel": "TRL 4 - Validação de Componentes em Ambiente Laboratorial",
    "perguntas": [
      {
        "pergunta": "Foram testados os componentes individuais do produto/processo em laboratório e realizados relatórios?"
      },
      {
        "pergunta": "Foram totalmente identificados os possíveis \"GAPs\" da tecnologia?"
      },
      {
        "pergunta": "Foram identificados os requisitos gerais do sistema para aplicação aos usuários finais?"
      },
      {
        "pergunta": "Foram estabelecidas as métricas de desempenho do produto/processo?"
      }
    ]
  },
  {
    "nivel": "TRL 5 - Validação do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "Foi realizada a definição preliminar de requisitos de desempenho no ambiente relevante?"
      },
      {
        "pergunta": "Foram identificadas e analisadas as funções críticas do produto/processo?"
      },
      {
        "pergunta": "Foi realizado o projeto preliminar do produto/processo, suportado por modelos apropriados para a verificação de funções críticas?"
      },
      {
        "pergunta": "Foram identificados os efeitos das possíveis falhas da tecnologia (se houver)?"
      },
      {
        "pergunta": "Foram identificados os requisitos de interface do sistema?"
      },
      {
        "pergunta": "Foram identificadas as interações entre os componentes/subsistemas?"
      },
      {
        "pergunta": "Foram realizados testes tecnológicos dos componentes em ambiente relevante?"
      }
    ]
  },
  {
    "nivel": "TRL 6 - Demonstração do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "Foram documentadas e analisadas as funções críticas do produto/processo?"
      },
      {
        "pergunta": "Foi realizada e documentada a definição de requisitos de desempenho e do ambiente relevante?"
      },
      {
        "pergunta": "Foram documentados os requisitos completos de sistema e subsistema para funcionamento?"
      },
      {
        "pergunta": "Foram concluídas as avaliações das características de desempenho da tecnologia, mesmo considerando os possíveis \"GAPs\"?"
      },
      {
        "pergunta": "Foi testado o modelo representativo (protótipo) completo em laboratório ou ambiente operacional de alta fidelidade (simulação)?"
      }
    ]
  },
  {
    "nivel": "TRL 7 - Demonstração do Protótipo em Ambiente Realista",
    "perguntas": [
      {
        "pergunta": "Foi documentada a definição do ambiente operacional e suas restrições?"
      },
      {
        "pergunta": "Foi documentada a definição de requisitos de desempenho para o ambiente operacional?"
      },
      {
        "pergunta": "Foi documentada a definição do modelo e os procedimentos para realização dos testes?"
      },
      {
        "pergunta": "Foram realizados testes em cada interface do sistema, sob condições normais e anômalas?"
      },
      {
        "pergunta": "Foram simuladas as funcionalidades disponíveis para demonstração em um ambiente operacional?"
      },
      {
        "pergunta": "O protótipo foi totalmente integrado ao ambiente real (ou simulado em um ambiente operacional adequado)?"
      },
      {
        "pergunta": "Os testes do protótipo do sistema foram realizados com sucesso no ambiente estipulado?"
      },
      {
        "pergunta": "Foi realizada a documentação completa dos testes do modelo de protótipo?"
      },
      {
        "pergunta": "Foram identificados e documentados os desafios técnicos e financeiros para a escalabilidade da tecnologia?"
      }
    ]
  },
  {
    "nivel": "TRL 8 - Certificação do Sistema Completo",
    "perguntas": [
      {
        "pergunta": "Foi construído e integrado o modelo final no sistema final (produto/processo)?"
      },
      {
        "pergunta": "Foram realizados ajustes dos componentes para compatibilidade com o sistema operacional?"
      },
      {
        "pergunta": "Foi testado o sistema e caracterizado com seu design e função para a aplicação pretendida?"
      },
      {
        "pergunta": "Foi concluída a documentação formal de regulamentação?"
      },
      {
        "pergunta": "Foi concluída a documentação da gestão e controle de configuração?"
      }
    ]
  },
  {
    "nivel": "TRL 9 - Sistema Operacional e Produção em Escala",
    "perguntas": [
      {
        "pergunta": "Foi plenamente demonstrado o sistema real em operação?"
      },
      {
        "pergunta": "Foi implementado com sucesso o conceito operacional da tecnologia?"
      },
      {
        "pergunta": "Foram realizados todos os processos de fabricação controlados para garantir o nível de qualidade adequado?"
      },
      {
        "pergunta": "Foram realizadas publicações científicas e/ou patentes a respeito da tecnologia?"
      },
      {
        "pergunta": "É possível reproduzir o mesmo projeto (ou aplicação) com os mesmos requisitos?"
      }
    ]
  }
]