[
  {
    "nivel": "TRL 1 - Princípios Básicos Observados e Relatados",
    "perguntas": [
      {
        "pergunta": "Os princípios físicos e eletrônicos que fundamentam o hardware foram identificados?",
        "explicacao": ""
      },
      {
        "pergunta": "Existem estudos ou experimentos que confirmam os princípios básicos do hardware? Foram realizados testes para validação dos conceitos fundamentais?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas restrições legais e normativas (como certificações de segurança elétrica, compatibilidade eletromagnética e descarte ambiental) que possam impactar o desenvolvimento do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram levantados riscos técnicos e desafios na viabilidade da implementação do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "As ferramentas e metodologias escolhidas para pesquisa e desenvolvimento do hardware permitem sua evolução para níveis superiores de maturidade tecnológica?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 2 - Formulação do Conceito Tecnológico",
    "perguntas": [
      {
        "pergunta": "Foram formuladas as potenciais aplicações do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as principais funções a serem desempenhadas pelo hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi identificada a funcionalidade do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados possíveis GAPs da tecnologia e documentados?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi documentada a viabilidade das aplicações do hardware, com base em estudos preliminares? Foram realizados testes para validação dos conceitos fundamentais?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 3 - Prova de Conceito Experimental",
    "perguntas": [
      {
        "pergunta": "Foi concretizada a realização do projeto conceitual do hardware e documentado?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram especificados os requisitos de desempenho do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi verificada a viabilidade da aplicação do hardware por experimentos de laboratório (simulação)? Foram realizados testes para validação dos conceitos fundamentais?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os possíveis defeitos do hardware em experimentos de laboratório?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi plenamente demonstrada a viabilidade científica do hardware?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas e desenvolvidas as técnicas de desenvolvimento do hardware?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 4 - Validação de Componentes em Ambiente Laboratorial",
    "perguntas": [
      {
        "pergunta": "Foram testados os componentes individuais do hardware em laboratório e realizados relatórios?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram totalmente identificados os possíveis GAPs da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os requisitos gerais do sistema para aplicação aos usuários finais?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram estabelecidas as métricas de desempenho do hardware?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 5 - Validação do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "Foi realizada a definição preliminar de requisitos de desempenho no ambiente relevante?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizado o projeto preliminar do hardware, suportado por modelos apropriados para a verificação de funções críticas?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os efeitos das possíveis falhas da tecnologia (se houver)?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados os requisitos de interface do sistema?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificadas as interações entre os componentes/subsistemas?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados testes tecnológicos dos componentes em ambiente relevante?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 6 - Demonstração do Sistema em Ambiente Relevante",
    "perguntas": [
      {
        "pergunta": "Foram identificadas e analisadas as funções críticas do hardware, verificadas e documentadas em relatório?",
        "explicacao": ""
      },
      {
        "pergunta": "O ambiente relevante de funcionamento para o sistema foi definido?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizada e documentada a definição de requisitos de desempenho e do ambiente relevante?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram documentados os requisitos completos de sistema e subsistema para funcionamento?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram concluídas as avaliações das características de desempenho da tecnologia, mesmo considerando os possíveis GAPs?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi testado o modelo representativo (protótipo) completo em laboratório ou ambiente operacional de alta fidelidade (simulação)?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 7 - Demonstração do Protótipo em Ambiente Realista",
    "perguntas": [
      {
        "pergunta": "Foi documentada a definição de requisitos de desempenho para o ambiente operacional?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi documentada a definição do ambiente operacional e suas restrições?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi documentada a definição do modelo e os procedimentos para realização dos testes?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados testes em cada interface do sistema, sob condições normais e anômalas?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram simuladas as funcionalidades disponíveis para demonstração em um ambiente operacional?",
        "explicacao": ""
      },
      {
        "pergunta": "O protótipo foi totalmente integrado ao ambiente real (ou simulado em um ambiente operacional adequado)?",
        "explicacao": ""
      },
      {
        "pergunta": "Os testes do protótipo do sistema foram realizados com sucesso no ambiente estipulado?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi realizada a documentação completa dos testes do modelo de protótipo?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram identificados e documentados os desafios técnicos e financeiros para a escalabilidade da tecnologia?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 8 - Certificação do Sistema Completo",
    "perguntas": [
      {
        "pergunta": "Foi construído e integrado o modelo final no sistema final (produto)?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados ajustes dos componentes para compatibilidade com o sistema operacional?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi testado o sistema e caracterizado com seu design e função para a aplicação pretendida?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi concluída a documentação formal de regulamentação?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi concluída a documentação da gestão e controle de configuração?",
        "explicacao": ""
      }
    ]
  },
  {
    "nivel": "TRL 9 - Sistema Operacional e Produção em Escala",
    "perguntas": [
      {
        "pergunta": "Foi plenamente demonstrado o sistema real em operação?",
        "explicacao": ""
      },
      {
        "pergunta": "Foi implementado com sucesso o conceito operacional da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizados todos os processos de fabricação controlados para garantir o nível de qualidade adequado?",
        "explicacao": ""
      },
      {
        "pergunta": "Foram realizadas publicações científicas e/ou patentes a respeito da tecnologia?",
        "explicacao": ""
      },
      {
        "pergunta": "É possível reproduzir o mesmo projeto com os mesmos requisitos?",
        "explicacao": ""
      }
    ]
  }
]